Revit 2024 API
FabricArea.DirectionOrigin Property
 The Origin Point of the Major Direction of the Fabric Area.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ DirectionOrigin { get; }
Visual Basic
Public ReadOnly Property DirectionOrigin As XYZ
	Get
Visual C++
public:
property XYZ^ DirectionOrigin {
	XYZ^ get ();
}
See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace